// Данное описание актуально для: бронебойного пистолета (PowerPistol), винтовки (Rifle) и бластера (Blaster)
{
	"name" : "[DoNotLoadInGame]", // Имя оружия, не должно повторяться. Имя которое указано здесь можно использовать повторно, 
	// однако обьекты с именем [DoNotLoadInGame] не будут загружаться при запуске игры
    "previewImage": "", // Картинка с предпросмотром (названия всех возможных картинок в файле GamePresets\Images.txt)
    
	// Здесь будет описание поведения оружия при помощи массивов (следующие 5 параметров)
	// В них можно указывать как одно, так и два значение, что зависит от количества видов атаки
	// Например, у бронебойного только один тип атаки (автоматическая стрельба), в товремя как
	// У бластера два: слабый и сильный выстрел. В массивах сначала указывается первый тип атаки, а затем второй
	// Важно понимать, что количество элементов во всех массивах должно быть одинаковым
	
	"bulletName": [ // Используемые патроны (их имена)
		"DefaultRifleBullet", // Для первого типа атаки
		"DefaultRifleBullet" // Для второго типа атаки
	],
	"shotRate": [ // Выстрелы в минуту
		600.0, // При первом типе атаки
		180.0 // При втором типе атаки
	],
	"gunFireLength": [ // Количество выстрелов в очереди
		1, // Одиночный выстрел
		4 // Четыре подряд идущих выстрела
	],
	"gunFireShotRate": [ // Выстрелы в минуту внутри очереди
		0.0, // Использовать значение 0.0 для атак с одиночным выстрелом
		1000.0 // Второй тип атаки можно использовать 180 раз в минуту, каждый раз оружие выстрелит 4 патрона с частотой 1000 выстрелов в минуту 
	],
	"intake": [ // Используемый боезапас
		1.0, // При каждом выстреле тратится один патрон
		1.0 // Каждый выстрел в очереди считается самостоятельным, поэтому второй тип атаки будет тратить 4 патрона
	],
	"magazineCapacity": 42, // Количество патронов в магазине
	"reloadTime": 1.5, // Длительность перезарядки (секунды)
	"partialReload": false, // Частичная перезарядка (как у дробовика или бластера, true или false)
	"partialLoad": 0, // Количество патронов, восполняемое за одну перезарядку (имеет эффект только когда partialReload = true)
	"dmgMultiplier": 1 // Множитель урона (не факт что вообще работает)
}

// В .json файле можно оставлять комментарии после двойного слэша "//" в любом месте
// В данном файле представлены все основные параметры для редактирования предмета, однако
// некоторые свойства можно при желании удалять (тогда параметры будут иметь значения по умолчанию)
// Например, можно удалить поле partialLoad при partialReload = false, т.к. его значение в таком случае ни на что не влияет