{
	"name" : "[DoNotLoadInGame]", // Имя щита, не должно повторяться. Имя которое указано здесь можно использовать повторно, 
	// однако обьекты с именем [DoNotLoadInGame] не будут загружаться при запуске игры
    "previewImage": "", // Картинка с предпросмотром (названия всех возможных картинок в файле GamePresets\Images.txt)
    "maxEnergy": 1000.0, // Энергия щита (количество урона, которое способен отразить щит)
	"damagePerSecond": 1100.0, // Урон в секунду (максимальное количество урона, 
	//  которое щит может отразить в течение секунды)
	"energyRestore": 100.0, // Восстановление энергии (количество энергии, которое восстановится за секунду)
	"rebootThreshold": 0.0, // Порог для перезагрузки (когда энергия щита ниже этого уровня, 
	//  он становится красным и перестаёт отражать урон)
	"rebootDuration": 10, // Длительность перезагрузки (секунды)
	"rebootBoost": 1.5, // Множитель восстановления энергии при перезагрузке
	//  (при перезагрузке восстанавливаемая в секунду энергия равна energyRestore * rebootBoost)
	"shieldScale": 0.8, // Визуальный размер щита, 0.8 - размер по умолчанию
    "shieldColor": { // Цвет щита в формате ARGB [0..1]
        "r": 0.32, // Красный канал (если в палитре канал задётся числами от 0 до 255, нужно просто разделить это число на 255)
        "g": 0.71, // Зелёный канал 
        "b": 1.0, // Синий канал
        "a": 1.0 // Альфа канал (непрозрачность) (вероятно, ни на что не влияет)
    },
	"damageToBlock": [ // Список с типами урона, который может отразить щит (здесь всё что есть)
		0, // Неизвестный
		1, // Твёрдый снаряд (пуля)
		2, // Плазменный снаряд
		3, // Огонь
		4, // Электричество
		5, // Яд
		6, // Ближний урон
		7 // Взрыв
	]
}

// В .json файле можно оставлять комментарии после двойного слэша "//" в любом месте
// В данном файле представлены все основные параметры для редактирования предмета, однако
// некоторые свойства можно при желании удалять (тогда параметры будут иметь значения по умолчанию)
// Например, можно удалить поле shieldColor и shieldScale, т.к. их редактирование маловероятно